//------------------------------------------------------------------------
// ● 使用ライブラリの宣言
//------------------------------------------------------------------------
using UnityEngine;
using System.Collections.Generic;
using UnityEngine.UI;
//========================================================================
// ■ Ending_Manager
//------------------------------------------------------------------------
//	エンディング管理クラス。
//========================================================================

public class Ending_Manager : Scene_Manager {
	//--------------------------------------------------------------------
	// ● メンバ変数
	//--------------------------------------------------------------------
	public Text score;
	Save_Data save;
	//--------------------------------------------------------------------
	// ● 初期化
	//--------------------------------------------------------------------
	protected override void Start() {
		base.Start();

		save = Base_Scripts.get_instance()
			.GetComponent<Save_Data>();
		save.is_openning = false;
	}
	//--------------------------------------------------------------------
	// ● 更新（更新）
	//--------------------------------------------------------------------
	protected override void update_update() {
		base.update_update();

		if ( Input.GetKeyDown(KeyCode.Space) ) {
//			Audio_Manager.se.play("");
			next_scene_name = "Title";
		}
	}
	//--------------------------------------------------------------------
	// ● ボタンが押されたコールバック関数
	//--------------------------------------------------------------------
	public override void on_click(GameObject go) {
		base.on_click(go);

//		Audio_Manager.se.play("");

		switch (go.name) {
			case "Button_Next":	next_scene_name = "Title";	break;
		}
	}
}