//------------------------------------------------------------------------
// ● 使用ライブラリの宣言
//------------------------------------------------------------------------
using UnityEngine;
using System.Collections;
//========================================================================
// ■ Opening_Event
//------------------------------------------------------------------------
//	オープニングのイベントクラス。
//========================================================================

public class Opening_Event : Collision_Mouse_Manager {
	//--------------------------------------------------------------------
	// ● 定数
	//--------------------------------------------------------------------
	static readonly string[] texts = new string[] {
		"現在私達が住んでいる世界、21世紀の地球。\n" +
			"核戦争の猛威、産業化による環境破壊、その結果の大災害・・・。",
		"科学がどこまで進歩しようとも、人類の争いは絶えず、罪は増えるばかり。",
		"その少し先の未来、何処かの場所で・・・",

		"・・・・・・",
		"昔、この世界は核で滅んだ。\n" +
			"環境破壊と温暖化により、南極と北極の氷も全て解けた。",
		"昔栄えた文明は見る影もなく、物資は足りなくなり、文明の遺物はとても貴重になった。",

		"・・・・・・",
		"・・・この地に、忘れ物をしてきてしまった。",
		"とても大切な物だった。\n" +
			"もっと早くに取りに戻るべきだった。",
		"この辺りの潮流は、最近になってやっと落ち着いた。\n" +
			"それでも、放射能の溶け込んだ水に触れると死んでしまう。",
		"・・・昔は泳ぐ事が好きだった。",

		"・・・・・・",
		"探しに行かなくちゃ・・・とても大切な物だから・・・。"
	};
	//--------------------------------------------------------------------
	// ● メンバ変数
	//--------------------------------------------------------------------
	Player player;
	UI_Talk talk;
	Save_Data save;
	int index;
	//--------------------------------------------------------------------
	// ● 初期化
	//--------------------------------------------------------------------
	void Start() {
		player = GameObject.FindWithTag("Player").GetComponent<Player>();
		talk = GameObject.FindWithTag("UI_Talk").GetComponent<UI_Talk>();

		save = Base_Scripts.get_instance().GetComponent<Save_Data>();
		if (!save.is_openning)	StartCoroutine( hoge() );
	}
	IEnumerator hoge() {
		yield return null;
		talk.start_event(texts[index], false, this);
	}
	//--------------------------------------------------------------------
	// ● 更新
	//--------------------------------------------------------------------
	void Update() {
	}
	//--------------------------------------------------------------------
	// ● ボタン押下コールバック関数
	//--------------------------------------------------------------------
	public override void on_click(GameObject button) {
		base.on_click(button);
		

		switch (button.name) {
			case "Button_Back_Ground":
				index++;
				if (index < texts.Length)
					talk.start_event(texts[index], false, this);
				else {
					talk.end_event();
					save.is_openning = true;
				}
				break;
		}
	}
}