//------------------------------------------------------------------------
// ● 使用ライブラリの宣言
//------------------------------------------------------------------------
using UnityEngine;
using UnityEngine.UI;
using System.Collections;
//========================================================================
// ■ UI_Title
//------------------------------------------------------------------------
//	ＵＩのタイトルクラス。
//========================================================================

public class UI_Title : Mono_Behaviour_EX {
	//--------------------------------------------------------------------
	// ● メンバ変数
	//--------------------------------------------------------------------
	Text text;
	Dragon dragon;
	Color default_color;
	float rate;
	//--------------------------------------------------------------------
	// ● 初期化
	//--------------------------------------------------------------------
	void Start() {
		text = GetComponent<Text>();
		default_color = text.color;
		dragon = GameObject.FindWithTag("Dragon")
			.GetComponent<Dragon>();
	}
	//--------------------------------------------------------------------
	// ● 更新
	//--------------------------------------------------------------------
	void Update() {
		rate += (dragon.fsm.state() is State_Sleep_Dragon ? -1 : 1) *
			Time.deltaTime;
		rate = Mathf.Clamp01(rate);

		text.color = Color.Lerp(
			default_color,
			new Color(1, 1, 1, 0),
			rate
		);
	}
}