//------------------------------------------------------------------------
// ● 使用ライブラリの宣言
//------------------------------------------------------------------------
using UnityEngine;
using System.Collections;
//========================================================================
// ■ State_Contact_Dragon
//------------------------------------------------------------------------
//	ドラゴンの接触状態クラス。
//========================================================================

public class State_Contact_Dragon : State_Base_Dragon {
	//--------------------------------------------------------------------
	// ● メンバ変数
	//--------------------------------------------------------------------

	//--------------------------------------------------------------------
	// ● 初期化
	//--------------------------------------------------------------------
	public override void initialize() {
		base.initialize();

		ai.animator.SetBool("Is_Idle", true);
	}
	//--------------------------------------------------------------------
	// ● 更新
	//--------------------------------------------------------------------
	public override void update() {
		base.update();
		

		if ( ai.animator.GetCurrentAnimatorStateInfo(0).IsName("Wait") )
			ai.animator.SetFloat("Idle_Type", ai.idle_type);

		if (Input_EX.is_start_fishing)
			ai.fsm.change( new State_Fishing_Dragon() );

		if (!Input_EX.is_human_exists)
			ai.fsm.change( new State_Sleep_Dragon() );
	}
	//--------------------------------------------------------------------
	// ● 更新（遅）
	//--------------------------------------------------------------------
	public override void late_update() {
		base.late_update();
	}
	//--------------------------------------------------------------------
	// ● 終了
	//--------------------------------------------------------------------
	public override void finalize() {
		base.finalize();

		ai.animator.SetBool("Is_Idle", false);
	}
	//--------------------------------------------------------------------
	// ● 衝突情報を受信
	//--------------------------------------------------------------------
	public override void receive_collision_data(ref Collision_Data data) {
		base.receive_collision_data(ref data);
	}
}