//------------------------------------------------------------------------
// ● 使用ライブラリの宣言
//------------------------------------------------------------------------
using UnityEngine;
using System.Collections;
//========================================================================
// ■ State_Wait_Camera
//------------------------------------------------------------------------
//	待機視点カメラの状態クラス。
//========================================================================

public class State_Wait_Camera : State_Base_Camera {
	//--------------------------------------------------------------------
	// ● メンバ変数
	//--------------------------------------------------------------------
	
	//--------------------------------------------------------------------
	// ● 初期化
	//--------------------------------------------------------------------
	override public void initialize() {
		base.initialize();	// 基盤クラスを初期化
	}
	//--------------------------------------------------------------------
	// ● 更新（遅い）
	//--------------------------------------------------------------------
	override public void late_update() {
		base.late_update();	// 基盤クラスを更新
		

		// 注視点を設定
		target_position = ai.player.position +
//			ai.offset;
			ai.player.rotation * ai.offset;

		// 位置を更新
		ai.transform.position = target_position +
			Quaternion.Euler(ai.euler_angles) *
			Vector3.forward * ai.distance;
		
		// 障害物補正
		var gaze_offset = ai.offset;
		gaze_offset.x = 0;
		correct_obstacle(
			ai.player.position + ai.player.rotation * gaze_offset);
	}
	//--------------------------------------------------------------------
	// ● 終了
	//--------------------------------------------------------------------
	override public void finalize() {
		base.finalize();	// 基盤クラスを終了
	}
}