//------------------------------------------------------------------------
// ● 使用ライブラリの宣言
//------------------------------------------------------------------------
using UnityEngine;
using System.Collections;
//========================================================================
// ■ Collision_Mouse_Detection
//------------------------------------------------------------------------
//	マウス衝突判定のクラス。
//========================================================================

public class Collision_Mouse_Detection : Mono_Behaviour_EX {
	//--------------------------------------------------------------------
	// ● メンバ変数
	//--------------------------------------------------------------------
	public Collision_Mouse_Manager manager;
	//--------------------------------------------------------------------
	// ● 初期化
	//--------------------------------------------------------------------
	void Start() {
		if (manager == null)
			manager = transform.root
				.GetComponent<Collision_Mouse_Manager>();
	}
	//--------------------------------------------------------------------
	// ● マウス押下コールバック関数
	//--------------------------------------------------------------------
	void OnMouseDown() {
		send_data( new Collision_Mouse_Data(
			transform, Collision_Mouse_Data.Type.MOUSE_DOWN) );
	}
	//--------------------------------------------------------------------
	// ● マウス押上コールバック関数
	//--------------------------------------------------------------------
	void OnMouseUp() {
		send_data( new Collision_Mouse_Data(
			transform, Collision_Mouse_Data.Type.MOUSE_UP) );
	}
	//--------------------------------------------------------------------
	// ● 衝突情報を送信
	//--------------------------------------------------------------------
	void send_data(Collision_Mouse_Data data) {
		if (manager != null)	manager.receive_data(ref data);
	}
}