//------------------------------------------------------------------------
// ● 使用ライブラリの宣言
//------------------------------------------------------------------------
using UnityEngine;
using System.Collections.Generic;
//========================================================================
// ■ Enemy_Status
//------------------------------------------------------------------------
//	敵のステータスクラス。
//========================================================================

public class Enemy_Status : Entity_Status {
	//--------------------------------------------------------------------
	// ● メンバ変数
	//--------------------------------------------------------------------
	public int max_bullets = 100;	// 残弾数
	[HideInInspector] public int bullets;
	//--------------------------------------------------------------------
	// ● 回復
	//--------------------------------------------------------------------
	public override void recovery() {
		base.recovery();

		bullets = max_bullets;
	}
	//--------------------------------------------------------------------
	// ● ダメージ処理
	//--------------------------------------------------------------------
	public override void damage(float impulsive_force) {
		base.damage(impulsive_force);

		if ( !ai.fsm.is_death() &&
			!(ai.fsm.state() is State_Blindsided_Enemy) )
		{
			ai.fsm.change( new State_Blindsided_Enemy() );
		}
	}
}